[
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "INDIAN PENAL CODE - KEY SECTIONS"
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 302 IPC - Punishment for Murder: Whoever commits murder shall be punished with death or imprisonment for life, and shall also be liable to fine. This is one of the most serious offences under the Indian Penal Code."
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 304 IPC - Punishment for Culpable Homicide Not Amounting to Murder: Whoever commits culpable homicide not amounting to murder shall be punished with imprisonment for life, or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine, if the act by which the death is caused is done with the intention of causing death, or of causing such bodily injury as is likely to cause death. This section deals with cases where there is intention to cause death but without premeditation that constitutes murder."
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 376 IPC - Punishment for Rape: Whoever, except in the cases provided for in sub-section (2), commits rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine. This is a serious sexual offence under Indian criminal law."
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 420 IPC - Cheating and Dishonestly Inducing Delivery of Property: Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine. This section deals with fraud and cheating offences."
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 498A IPC - Husband or Relative of Husband Subjecting Woman to Cruelty: Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine. Cruelty includes both physical and mental harassment. This is a cognizable and non-bailable offence."
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 323 IPC - Punishment for Voluntarily Causing Hurt: Whoever, except in the case provided for by section 334, voluntarily causes hurt, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both. This covers simple hurt or injury caused to another person."
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 379 IPC - Punishment for Theft: Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both. Theft is defined as dishonestly taking movable property out of the possession of another person without their consent."
  },
  {
    "filename": "IPC_Sample_Sections.txt",
    "content": "Section 406 IPC - Punishment for Criminal Breach of Trust: Whoever commits criminal breach of trust shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both. This applies when someone entrusted with property dishonestly misappropriates it or converts it to their own use."
  }
]